chapters/beginning-python.org
# -*- org-link-file-path-type: relative; -*- 
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Beginning Python
#+date: <2023-02-07 Tue>
#+author: Britt Anderson
#+email: britt@uwaterloo.ca
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6-pre)
#+bibliography: /home/britt/gitRepos/Intro2Computing4Psychology/chapters/i2c4p.bib
#+cite_export: csl assets/chicago-note-bibliography-16th-edition.csl

* Overview

  What is programming, and what are some of the basics of approach and terminology? Using python as an example, basic concepts such as variables, loops, indexing and assignments are illustrated. We will also begin to examine how we can mix code with text in Emacs in preparing to generate reproducible research reports that mix code, data, text, and references. Our tool for that is called /org babel/.

* General Programming Concepts Illustrated with Python
  These general comments apply to more than just python. For some of the particular examples of code python is used as the example language.

  #+begin_export html
  <iframe src="https://player.vimeo.com/video/458286292?h=20549870b8" width="640" height="361" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/458286292">Ga : Intro to Intro to Programming (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export


** A digression on programming (aka writing code)
I write below a few thoughts about what to think about before you start typing. In the video that follows I talk about some of the terminology and lingo that is often invoked when programming.

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458286273?h=6c830c2c19" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458286273">Gb : Some general comments on programming (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A few general comments on programming, which boil down to know what you want to do and how you want to do it before you starting typing your code.</p>
#+end_export
*** It is nothing deep: thinking before doing saves you time and improves the result. 
    You are writing a recipe. Do these things to get this result. Just like cooking has a certain vocabulary you need to know to follow or write a recipe, the same is true of programming.

    Just like you have to think what you want to cook before you write a recipe, and you often have to go through several test dishes to perfect your recipe the same is true of programming. 
    - [[https://www.quora.com/What-should-go-in-my-mind-before-I-start-writing-code/answer/Marcelo-Calder%C3%B3n][Think what you want to do first]].
      [[https://medium.com/edge-coders/the-mistakes-i-made-as-a-beginner-programmer-ac8b3e54c312][Another blog in support of this idea]].
    - [[https://www.quora.com/Should-you-always-write-pseudocode-before-real-code/answer/Bruce-Richardson-4][Sketch out how the different pieces of your plan need to go together]].
    - *Only then* decide on which programming language and tools best suit this purpose. Sometimes this will be biased by what you know, but often it can be driven by what *libraries* and *packages* have already been written by other that will do some or most of what you want to do.
    - Select the tool for writing your code. Selection of an *ide* (integrated development environment) is a large [[*IDEs][IDEs]] to itself. It is more a matter of style,taste and your community than technical advantages; that is why there are so many of them. Here you will be using Emacs, but after this course most of you will probably settle on a different IDE. Shop around before you settle down.
    - *Only now* should you start typing your code.
      If you know what you want to happen, and how you want it to happen, then finding the right keyword in R or Python or most other languages is a comparatively easy task.
** Compilation versus Interpretation
   Are you simultaneously translating a conversation or translating a book?
*** Interpreters 
    are tools that take your code one line at a time and translate that into the language your computer speaks. It is like a simultaneous translation of a language. When you start a python or R interpreter you are asking that each line you type be immediately translated and executed.
    The advantages of this are that it can lead to quicker feedback, and encourage exploration. The disadvantage is that it is usually slower than compiled code, and it is not the sort of thing you can share with a non-technical user.
*** Compilers 
    are tools for taking an entire text of code (like a book) and translating that into machine code. Thus, compilers can exploit their knowledge of the whole document to make things run more efficiently or robustly. The advantage is you can share the result, your program or application, with a non-technical user and they can input their data or use the program via your coded interface. The downside is that development can be slower and more complex.
*** Which is better?
    Neither. Different tasks require different tools. An R interpreter is a great way to conduct data exploration. A compiled c program might be the better way to tackle a large scale complex data analysis routine. 







