book/beginning-python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-23 Sun 11:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beginning Python</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Beginning Python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgac25a48">1. Overview</a></li>
<li><a href="#org471d533">2. General Programming Concepts Illustrated with Python</a>
<ul>
<li><a href="#org1622e74">2.1. A digression on programming (aka writing code)</a>
<ul>
<li><a href="#org7292034">2.1.1. It is nothing deep: thinking before doing saves you time and improves the result.</a></li>
</ul>
</li>
<li><a href="#orgf9a8f4d">2.2. Compilation versus Interpretation</a>
<ul>
<li><a href="#org95f170a">2.2.1. Interpreters</a></li>
<li><a href="#orgccc6659">2.2.2. Compilers</a></li>
<li><a href="#org68da629">2.2.3. Which is better?</a></li>
</ul>
</li>
<li><a href="#orgf8af099">2.3. Coding styles</a></li>
<li><a href="#orga398ee4">2.4. Org-babel</a></li>
<li><a href="#orgd23cd00">2.5. Some programming vocabulary</a>
<ul>
<li><a href="#org17608e2">2.5.1. Data often come in <b>Types</b></a></li>
<li><a href="#org1ed1b2c">2.5.2. Constants and Variables</a></li>
<li><a href="#orgdf588a8">2.5.3. Assignment and Equality</a></li>
<li><a href="#org4fa9ae9">2.5.4. Loops</a></li>
<li><a href="#orgfbce17b">2.5.5. Functions</a></li>
<li><a href="#orgb3ba5f4">2.5.6. Libraries</a></li>
<li><a href="#org1926ff8">2.5.7. Programs</a></li>
<li><a href="#org399ca38">2.5.8. Debugging and Basic Working Methods</a></li>
<li><a href="#org9759feb">2.5.9. IDEs</a></li>
</ul>
</li>
<li><a href="#orga9d081c">2.6. Pip to Install Libraries and Virtual Environments</a>
<ul>
<li><a href="#orgcad3d12">2.6.1. Pip</a></li>
<li><a href="#org1c6537e">2.6.2. Virtual Environments</a></li>
<li><a href="#orgbb1d443">2.6.3. Beginning Python Assessment 2</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgea17ae7">3. Assessments</a>
<ul>
<li><a href="#org37ffc04">3.1. For Loop with Python</a>
<ul>
<li><a href="#orge0affa1">3.1.1. Task</a></li>
<li><a href="#orgd3addd5">3.1.2. What it should look like</a></li>
<li><a href="#org3032d6a">3.1.3. Detailed Instructions</a></li>
<li><a href="#orgd717d0c">3.1.4. Comments</a></li>
<li><a href="#orgc4a6202">3.1.5. How I Will Grade</a></li>
</ul>
</li>
<li><a href="#orgd97419d">3.2. Hangman in Python (starter kit)</a>
<ul>
<li><a href="#orgf6c3db4">3.2.1. Words of Encouragement</a></li>
<li><a href="#orgee39311">3.2.2. Task</a></li>
<li><a href="#org9d7943f">3.2.3. Detail - tackle this in steps.</a></li>
<li><a href="#orgacaf0b7">3.2.4. Comments</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgac25a48" class="outline-2">
<h2 id="orgac25a48"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
What is programming, and what are some of the basics of approach and terminology? Using python as an example, basic concepts such as variables, loops, indexing and assignments are illustrated. We will also begin to examine how we can mix code with text in Emacs in preparing to generate reproducible research reports that mix code, data, text, and references. Our tool for that is called <i>org babel</i>.
</p>
</div>
</div>

<div id="outline-container-org471d533" class="outline-2">
<h2 id="org471d533"><span class="section-number-2">2.</span> General Programming Concepts Illustrated with Python</h2>
<div class="outline-text-2" id="text-2">
<p>
These general comments apply to more than just python. For some of the particular examples of code python is used as the example language.
</p>

  <iframe src="https://player.vimeo.com/video/458286292?h=20549870b8" width="640" height="361" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/458286292">Ga : Intro to Intro to Programming (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
</div>


<div id="outline-container-org1622e74" class="outline-3">
<h3 id="org1622e74"><span class="section-number-3">2.1.</span> A digression on programming (aka writing code)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I write below a few thoughts about what to think about before you start typing. In the video that follows I talk about some of the terminology and lingo that is often invoked when programming.
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458286273?h=6c830c2c19" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458286273">Gb : Some general comments on programming (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A few general comments on programming, which boil down to know what you want to do and how you want to do it before you starting typing your code.</p>
</div>
<div id="outline-container-org7292034" class="outline-4">
<h4 id="org7292034"><span class="section-number-4">2.1.1.</span> It is nothing deep: thinking before doing saves you time and improves the result.</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
You are writing a recipe. Do these things to get this result. Just like cooking has a certain vocabulary you need to know to follow or write a recipe, the same is true of programming.
</p>

<p>
Just like you have to think what you want to cook before you write a recipe, and you often have to go through several test dishes to perfect your recipe the same is true of programming. 
</p>
<ul class="org-ul">
<li><a href="https://www.quora.com/What-should-go-in-my-mind-before-I-start-writing-code/answer/Marcelo-Calder%C3%B3n">Think what you want to do first</a>.
<a href="https://medium.com/edge-coders/the-mistakes-i-made-as-a-beginner-programmer-ac8b3e54c312">Another blog in support of this idea</a>.</li>
<li><a href="https://www.quora.com/Should-you-always-write-pseudocode-before-real-code/answer/Bruce-Richardson-4">Sketch out how the different pieces of your plan need to go together</a>.</li>
<li><b>Only then</b> decide on which programming language and tools best suit this purpose. Sometimes this will be biased by what you know, but often it can be driven by what <b>libraries</b> and <b>packages</b> have already been written by other that will do some or most of what you want to do.</li>
<li>Select the tool for writing your code. Selection of an <b>ide</b> (integrated development environment) is a large <a href="#org9759feb">IDEs</a> to itself. It is more a matter of style,taste and your community than technical advantages; that is why there are so many of them. Here you will be using Emacs, but after this course most of you will probably settle on a different IDE. Shop around before you settle down.</li>
<li><b>Only now</b> should you start typing your code.
If you know what you want to happen, and how you want it to happen, then finding the right keyword in R or Python or most other languages is a comparatively easy task.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf9a8f4d" class="outline-3">
<h3 id="orgf9a8f4d"><span class="section-number-3">2.2.</span> Compilation versus Interpretation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Are you simultaneously translating a conversation or translating a book?
</p>
</div>
<div id="outline-container-org95f170a" class="outline-4">
<h4 id="org95f170a"><span class="section-number-4">2.2.1.</span> Interpreters</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
are tools that take your code one line at a time and translate that into the language your computer speaks. It is like a simultaneous translation of a language. When you start a python or R interpreter you are asking that each line you type be immediately translated and executed.
The advantages of this are that it can lead to quicker feedback, and encourage exploration. The disadvantage is that it is usually slower than compiled code, and it is not the sort of thing you can share with a non-technical user.
</p>
</div>
</div>
<div id="outline-container-orgccc6659" class="outline-4">
<h4 id="orgccc6659"><span class="section-number-4">2.2.2.</span> Compilers</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
are tools for taking an entire text of code (like a book) and translating that into machine code. Thus, compilers can exploit their knowledge of the whole document to make things run more efficiently or robustly. The advantage is you can share the result, your program or application, with a non-technical user and they can input their data or use the program via your coded interface. The downside is that development can be slower and more complex.
</p>
</div>
</div>
<div id="outline-container-org68da629" class="outline-4">
<h4 id="org68da629"><span class="section-number-4">2.2.3.</span> Which is better?</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Neither. Different tasks require different tools. An R interpreter is a great way to conduct data exploration. A compiled c program might be the better way to tackle a large scale complex data analysis routine. 
</p>
</div>
</div>
</div>
