chapters/beginning-python.org
** Coding styles
   Makes your code easier to read by people using the same language.
     
   Try to follow good programming style, and if available, language guides.

   [[https://www.python.org/dev/peps/pep-0008/][Python Style Guide]]




** Org-babel

For those of you who prefer video you can watch this. All the information is contained in the following text though.

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458285882?h=efd6bf2145" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458285882">Gc : An Introduction to Org Babel (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A somewhat longer demonstration of getting emacs set-up to use org and babel, and some simple demonstrations in python (and a few mistakes explained too).</p>
#+end_export

   Org-babel is a way to include code in an org document and have it properly execute. There is, of course, an Emacs manual : ~C-h i~ Search for org mode and in the org mode manual look for the "[[info:org#Library of Babel][Library of Babel]]".  A pretty extensive tutorial can be found [[https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org][here]]. A more recent workshop gives examples [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][here]].

   We will want some basic text in our =init.el= file to make things work. See [[file:emacsPythonIdeInstructions.org][here]] as well for some hints on getting started with your ~init.el~ file.
   #+begin_src emacslisp :eval never
   (setq org-confirm-babel-evaluate nil)
   (setq org-babel-python-command "python3")
     (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t) 
     (R . t)
     (python . t)))
   #+end_src

   Then you can create a source code block with

   #+begin_example
   
   #+Begin_src <langname> :exports code
   <code here ... code here>
   #+End_src 

   #+end_example
   There are many optional arguments that can appear on the line with "Begin" that will affect how the output appears and how it gets updated. Many of these *header* arguments are different for different languages and are presented [[https://org-babel.readthedocs.io/en/latest/header-args/][here]]. 


   Here is a functioning babel block for R [fn:2]

   #+begin_src R :session *beginpythonR*
     a = 2
     b = c(1,2)
     a + b
   #+end_src

   #+RESULTS:
   | 3 |
   | 4 |
   

   Note what we did there? We added the same number "2" to each of two other numbers that we put in a list.
   
   And another code block for python

   #+Begin_src python :results output :exports both :session *beginpython*
   my_name = "britt"
   my_name_as_list = list(my_name)
   for i, j in enumerate(my_name_as_list):
       print((i, j))
   #+End_src

   #+RESULTS:
   : (0, 'b')
   : (1, 'r')
   : (2, 'i')
   : (3, 't')
   : (4, 't')



** Some programming vocabulary
Many of the examples and much of the text that is written below is also reviewed in this companion video.

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458286198?h=952e09c8dc" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458286198">Gd : Common programming terms (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>An overview of a few basic and fundamental programming terms.</p>
#+end_export

*** Data often come in *Types*
    Some languages dynamically type whereas other statically type. Python tries to figure out whether you meant "1" to be a character or a numeral and may interpret it as either depending on context. That can make it easier for you to just get working and not worry about all the details. In a statically typed language you may have to tell your compiler or interpreter exactly how you want it to interpret a particular "1". This can make writing your code slower and more wordy, but gives you a lower risk of errors later on.
**** Some common [[https://docs.python.org/3/library/stdtypes.html][types]]
     - Integers :: 1, 2, ...
     - Doubles/Floats :: 10.3, pi; basically numbers that have decimal points. Thus, 1.000000 is not the same as the integer 1. 
     - Booleans :: True , False 
                   NB: some languages, e.g. R, use TRUE. 
     - Lists and Tuples ::
       - Tuples :: (1,2), ('a',10.34,False) Have a fixed number of slots, can be different types.
                   Define with parentheses usually, but check your programming languages specifications.
       - Lists  :: [1,2,3,4] Have a potentially infinite number of slots, but must all be same type.
                   Define with square brackets in python.
     - Dictionaries :: {'firstName' : 'Britt', 'lastName' : 'Anderson'}; Also referred to as key:value pairs. In python the curly braces are used. 
     - Comments :: Not really code, but allows you to put stuff in your programs for other users and yourself to read. In python the lines start with a hash "#"
*** Constants and Variables
    A conceptual difference more than a implementation difference in python. Do you think the value will always be the same, like hours in the day, then it is a "constant". Do you think that the value will mutate over the course your program runs, like the time on a clock, then it is a variable. Both may be defined in python with an equal sign. Some people use the typography to distinguish the two, but note that some programming languages are case sensitive meaning ~ONE~ is different from ~one~. 

    #+begin_src python  :session *beginpython* :exports both :results value replace
      NUM_DAY_PER_YEAR = 365
      x = NUM_DAY_PER_YEAR
      days_this_year = x + 1
      days_this_year
      #+end_src

      #+RESULTS:
      : 366







    

Here we treat the number of days in a regular year as a constant while allowing ~daysThisYear~ to be a variable which can change with a leap year. 
*** Assignment and Equality
    ~=~ is different from ~==~

 #+begin_src python :results output :exports both :session *beginpython*
 a = 2
 print(a == 3)
 #+end_src

 #+RESULTS:
 : False
*** Loops
    We saw a quick demonstration of this above. The intuition remains that of a recipe: "stir egg whites until peaked" or "simmer for 30 minutes".
