book/beginning-python.html







<div id="outline-container-orgf8af099" class="outline-3">
<h3 id="orgf8af099"><span class="section-number-3">2.3.</span> Coding styles</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Makes your code easier to read by people using the same language.
</p>

<p>
Try to follow good programming style, and if available, language guides.
</p>

<p>
<a href="https://www.python.org/dev/peps/pep-0008/">Python Style Guide</a>
</p>
</div>
</div>




<div id="outline-container-orga398ee4" class="outline-3">
<h3 id="orga398ee4"><span class="section-number-3">2.4.</span> Org-babel</h3>
<div class="outline-text-3" id="text-2-4">
<p>
For those of you who prefer video you can watch this. All the information is contained in the following text though.
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458285882?h=efd6bf2145" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458285882">Gc : An Introduction to Org Babel (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A somewhat longer demonstration of getting emacs set-up to use org and babel, and some simple demonstrations in python (and a few mistakes explained too).</p>

<p>
Org-babel is a way to include code in an org document and have it properly execute. There is, of course, an Emacs manual : <code>C-h i</code> Search for org mode and in the org mode manual look for the "<a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Library-of-Babel">Library of Babel</a>".  A pretty extensive tutorial can be found <a href="https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org">here</a>. A more recent workshop gives examples <a href="http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html">here</a>.
</p>

<p>
We will want some basic text in our <code>init.el</code> file to make things work. See <a href="emacsPythonIdeInstructions.html">here</a> as well for some hints on getting started with your <code>init.el</code> file.
</p>
<div class="org-src-container">
<pre class="src src-emacslisp">(setq org-confirm-babel-evaluate nil)
(setq org-babel-python-command "python3")
  (org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t) 
  (R . t)
  (python . t)))
</pre>
</div>

<p>
Then you can create a source code block with
</p>

<pre class="example" id="orgd5b422a">

#+Begin_src &lt;langname&gt; :exports code
&lt;code here ... code here&gt;
#+End_src 

</pre>
<p>
There are many optional arguments that can appear on the line with "Begin" that will affect how the output appears and how it gets updated. Many of these <b>header</b> arguments are different for different languages and are presented <a href="https://org-babel.readthedocs.io/en/latest/header-args/">here</a>. 
</p>


<p>
Here is a functioning babel block for R <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-R">a = 2
b = c(1,2)
a + b
</pre>
</div>


<p>
Note what we did there? We added the same number "2" to each of two other numbers that we put in a list.
</p>

<p>
And another code block for python
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">my_name</span> = <span style="color: #8b2252;">"britt"</span>
<span style="color: #a0522d;">my_name_as_list</span> = <span style="color: #483d8b;">list</span>(my_name)
<span style="color: #a020f0;">for</span> i, j <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(my_name_as_list):
    <span style="color: #483d8b;">print</span>((i, j))
</pre>
</div>

<pre class="example">
(0, 'b')
(1, 'r')
(2, 'i')
(3, 't')
(4, 't')
</pre>
</div>
</div>



<div id="outline-container-orgd23cd00" class="outline-3">
<h3 id="orgd23cd00"><span class="section-number-3">2.5.</span> Some programming vocabulary</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Many of the examples and much of the text that is written below is also reviewed in this companion video.
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458286198?h=952e09c8dc" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458286198">Gd : Common programming terms (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>An overview of a few basic and fundamental programming terms.</p>
</div>

<div id="outline-container-org17608e2" class="outline-4">
<h4 id="org17608e2"><span class="section-number-4">2.5.1.</span> Data often come in <b>Types</b></h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Some languages dynamically type whereas other statically type. Python tries to figure out whether you meant "1" to be a character or a numeral and may interpret it as either depending on context. That can make it easier for you to just get working and not worry about all the details. In a statically typed language you may have to tell your compiler or interpreter exactly how you want it to interpret a particular "1". This can make writing your code slower and more wordy, but gives you a lower risk of errors later on.
</p>
</div>
<ol class="org-ol">
<li><a id="orga6b3b86"></a>Some common <a href="https://docs.python.org/3/library/stdtypes.html">types</a><br />
<div class="outline-text-5" id="text-2-5-1-1">
<dl class="org-dl">
<dt>Integers</dt><dd>1, 2, &#x2026;</dd>
<dt>Doubles/Floats</dt><dd>10.3, pi; basically numbers that have decimal points. Thus, 1.000000 is not the same as the integer 1.</dd>
<dt>Booleans</dt><dd>True , False 
NB: some languages, e.g. R, use TRUE.</dd>
<dt>Lists and Tuples</dt><dd><dl class="org-dl">
<dt>Tuples</dt><dd>(1,2), ('a',10.34,False) Have a fixed number of slots, can be different types.
Define with parentheses usually, but check your programming languages specifications.</dd>
<dt>Lists </dt><dd>[1,2,3,4] Have a potentially infinite number of slots, but must all be same type.
Define with square brackets in python.</dd>
</dl></dd>
<dt>Dictionaries</dt><dd>{'firstName' : 'Britt', 'lastName' : 'Anderson'}; Also referred to as key:value pairs. In python the curly braces are used.</dd>
<dt>Comments</dt><dd>Not really code, but allows you to put stuff in your programs for other users and yourself to read. In python the lines start with a hash "#"</dd>
</dl>
</div>
</li>
</ol>
</div>
<div id="outline-container-org1ed1b2c" class="outline-4">
<h4 id="org1ed1b2c"><span class="section-number-4">2.5.2.</span> Constants and Variables</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
A conceptual difference more than a implementation difference in python. Do you think the value will always be the same, like hours in the day, then it is a "constant". Do you think that the value will mutate over the course your program runs, like the time on a clock, then it is a variable. Both may be defined in python with an equal sign. Some people use the typography to distinguish the two, but note that some programming languages are case sensitive meaning <code>ONE</code> is different from <code>one</code>. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">NUM_DAY_PER_YEAR</span> = 365
<span style="color: #a0522d;">x</span> = NUM_DAY_PER_YEAR
<span style="color: #a0522d;">days_this_year</span> = x + 1
days_this_year
</pre>
</div>

<pre class="example">
366
</pre>










<p>
Here we treat the number of days in a regular year as a constant while allowing <code>daysThisYear</code> to be a variable which can change with a leap year. 
</p>
</div>
</div>
<div id="outline-container-orgdf588a8" class="outline-4">
<h4 id="orgdf588a8"><span class="section-number-4">2.5.3.</span> Assignment and Equality</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
<code>=</code> is different from <code>==</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">a</span> = 2
<span style="color: #483d8b;">print</span>(a == 3)
</pre>
</div>

<pre class="example">
False
</pre>
</div>
</div>
<div id="outline-container-org4fa9ae9" class="outline-4">
<h4 id="org4fa9ae9"><span class="section-number-4">2.5.4.</span> Loops</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
We saw a quick demonstration of this above. The intuition remains that of a recipe: "stir egg whites until peaked" or "simmer for 30 minutes".
</p>
</div>
<ol class="org-ol">
