chapters/beginning-python.org
**** For Loop
     Python refers to things called "iterables." To iterate is another way of saying something you can keep doing the same thing over and over to. Imagine a bowl of ice cream. It is "eatable". You take one spoon, and keep taking spoonfuls until the bowl is empty. 
***** Indexing
      You can get the location of an element in a list by referring to its /index/. Think of the row or column number in a spread sheet program, but indexes can be more powerful, and can be nested easily. In many programming languages, but sadly not all, indexes start at 0. Different programming languages will have slightly different syntax. 
      #+Name: Indexing
      #+begin_src python :session *beginpython* :exports both :results output
	name_dict = {'firstName' : 'Britt', 'lastName' : 'Anderson'}
	my_list = list(range(1, 10))

	print(name_dict['firstName'])

	print(my_list)

	print(my_list[0])

	print(my_list[-1])

	print(my_list[0:4])
      #+end_src

      #+RESULTS: Indexing
      : Britt
      : [1, 2, 3, 4, 5, 6, 7, 8, 9]
      : 1
      : 9
      : [1, 2, 3, 4]

      The use of the =-1= as an index is a python trick for getting the last element in a list. Think of the list as a circle. If you count backwards from a list you will get to the beginning eventually (index 0) if you went back one more step (-1) you would circle back to the end of the list. Test what happens when you try -2. Does it keep going? A lot of learning how to program is just doing stuff to see what happens.
     
      #+Name: For Loop
      #+begin_src python :session *beginpython* :exports both :results output
	for ml in my_list:
            print(ml)


	for i, ml in enumerate(my_list):
            print("The {0}th element was {1}".format(i, ml))
      #+end_src

      #+RESULTS: For Loop
      #+begin_example
      1
      2
      3
      4
      5
      6
      7
      8
      9
      The 0th element was 1
      The 1th element was 2
      The 2th element was 3
      The 3th element was 4
      The 4th element was 5
      The 5th element was 6
      The 6th element was 7
      The 7th element was 8
      The 8th element was 9
      #+end_example
**** While Loop
     These are like ~for~ loops in that they do stuff over and over, but unlike ~for~ loops they do things indefinitely, until that is, you tell them to stop. How do you do that? You use a /predicate/ that they test for each time through the loop.
**** Conditionals
     This is where you test whether something is or is not ~True~. Note that Python, but not all computer languages, treats 0 the same as False, and all non-zero values as True. 

     #+begin_src python :exports code  :session *beginpython* :results output
       if 2 == 3:
           print("Wha.....?\n\n")
       elif 3 == 2:
           print("Now that is odd")
       else:
           print("2 does not equal 3.")
     #+end_src

     #+RESULTS:
     : 2 does not equal 3.

     NB: note the use of colon (:) at the end of the =for= and =while= lines. 

     #+begin_src python :exports both :session *beginpython* :results output
       i = 0
       while i <= 10:
           print("brittAnderson"[i])
           i = i + 1
         #+end_src

         #+RESULTS:
	 #+begin_example
	 b
	 r
	 i
	 t
	 t
	 A
	 n
	 d
	 e
	 r
	 s
	 #+end_example
	 
*** Functions
    We encountered an [[file:rstudio.org::*Functions][example]] of this earlier. Think
    of a function as a machine that grinds meat. You pour in a cow.
    You get out hamburger. Input -> Output. Note that arguments are
    "local". They are not referring to variables outside the function,
    in the program globally, but only make sense locally in the
    function. You drop values into those slots, and then you can use
    those names in your function, because until you use it, your
    function doesn't know what it will be getting.
 #+begin_src python :exports code  :session *beginpython*
 def my_add(x, y):
    return(x + y)
 #+end_src

 #+RESULTS:

 #+begin_src python :exports both :results output :session *beginpython*
 my_add(2, 3)
 #+end_src

 #+RESULTS:

*** Libraries
    Lots of people use python. Python has been around a long time. Almost anything you might think to do at this point has been done by someone else. Look for a library and use someone else's code if you can. Use your time and effort to perfect your particular project, not to reinvent the wheel. An advantage of popular libraries is that they are likely to have withstood the tests of many users and will be more robust and correct than something you are likely to write as a first effort. 
**** What are some popular libraries?  
     [[https://pythontips.com/2013/07/30/20-python-libraries-you-cant-live-without/][Here]] are 20 recommended ones (and a more recent [[https://www.ubuntupit.com/best-python-libraries-and-packages-for-beginners/][list]]).
     
     Of particular note for us are:
     1. Numpy
     2. Scipy
     3. Matplotlib
     4. Pillow
     5. Sympy

*** Programs
    Programs are simply collections of all of the above. Complex programs may have smaller programs as components or span many files and subsidiary libraries.
*** Debugging and Basic Working Methods
    Debugging refers to the general process of finding the mistakes in your code and fixing them. Bugs can be mistakes that keep your code from running or they can be mistakes in your logic. Then the code runs, but it doesn't do what you want. Those are the worst, and the hardest to fix. 
   
    Many programming environments will provide sophisticated tools for debugging, but to get going a fairly simple technique is to embed many ~print~ statements into your code so that you can see what happening and whether your variables are actually changing like you think they should. When all is working well go back into your code and _comment out_ or delete the print statements. 
*** IDEs
    What does IDE stand for: Integrated development environment.

    Two popular python IDEs are:
    1. Spyder
    2. pyCharm
