book/beginning-python.html
<li><a id="org4c7855e"></a>For Loop<br />
<div class="outline-text-5" id="text-2-5-4-1">
<p>
Python refers to things called "iterables." To iterate is another way of saying something you can keep doing the same thing over and over to. Imagine a bowl of ice cream. It is "eatable". You take one spoon, and keep taking spoonfuls until the bowl is empty. 
</p>
</div>
<ol class="org-ol">
<li><a id="orgabfad06"></a>Indexing<br />
<div class="outline-text-6" id="text-2-5-4-1-1">
<p>
You can get the location of an element in a list by referring to its <i>index</i>. Think of the row or column number in a spread sheet program, but indexes can be more powerful, and can be nested easily. In many programming languages, but sadly not all, indexes start at 0. Different programming languages will have slightly different syntax. 
</p>
<div class="org-src-container">
<pre class="src src-python" id="orgd728dde"><span style="color: #a0522d;">name_dict</span> = {<span style="color: #8b2252;">'firstName'</span> : <span style="color: #8b2252;">'Britt'</span>, <span style="color: #8b2252;">'lastName'</span> : <span style="color: #8b2252;">'Anderson'</span>}
<span style="color: #a0522d;">my_list</span> = <span style="color: #483d8b;">list</span>(<span style="color: #483d8b;">range</span>(1, 10))

<span style="color: #483d8b;">print</span>(name_dict[<span style="color: #8b2252;">'firstName'</span>])

<span style="color: #483d8b;">print</span>(my_list)

<span style="color: #483d8b;">print</span>(my_list[0])

<span style="color: #483d8b;">print</span>(my_list[-1])

<span style="color: #483d8b;">print</span>(my_list[0:4])
</pre>
</div>

<pre class="example">
Britt
[1, 2, 3, 4, 5, 6, 7, 8, 9]
1
9
[1, 2, 3, 4]
</pre>


<p>
The use of the <code>-1</code> as an index is a python trick for getting the last element in a list. Think of the list as a circle. If you count backwards from a list you will get to the beginning eventually (index 0) if you went back one more step (-1) you would circle back to the end of the list. Test what happens when you try -2. Does it keep going? A lot of learning how to program is just doing stuff to see what happens.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org8f300f6"><span style="color: #a020f0;">for</span> ml <span style="color: #a020f0;">in</span> my_list:
    <span style="color: #483d8b;">print</span>(ml)


<span style="color: #a020f0;">for</span> i, ml <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(my_list):
    <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"The {0}th element was {1}"</span>.<span style="color: #483d8b;">format</span>(i, ml))
</pre>
</div>

<pre class="example" id="org7587d52">
1
2
3
4
5
6
7
8
9
The 0th element was 1
The 1th element was 2
The 2th element was 3
The 3th element was 4
The 4th element was 5
The 5th element was 6
The 6th element was 7
The 7th element was 8
The 8th element was 9
</pre>
</div>
</li>
</ol>
</li>
<li><a id="org24c28b4"></a>While Loop<br />
<div class="outline-text-5" id="text-2-5-4-2">
<p>
These are like <code>for</code> loops in that they do stuff over and over, but unlike <code>for</code> loops they do things indefinitely, until that is, you tell them to stop. How do you do that? You use a <i>predicate</i> that they test for each time through the loop.
</p>
</div>
</li>
<li><a id="org69ff150"></a>Conditionals<br />
<div class="outline-text-5" id="text-2-5-4-3">
<p>
This is where you test whether something is or is not <code>True</code>. Note that Python, but not all computer languages, treats 0 the same as False, and all non-zero values as True. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">if</span> 2 == 3:
    <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"Wha.....?\n\n"</span>)
<span style="color: #a020f0;">elif</span> 3 == 2:
    <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"Now that is odd"</span>)
<span style="color: #a020f0;">else</span>:
    <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"2 does not equal 3."</span>)
</pre>
</div>

<p>
NB: note the use of colon (:) at the end of the <code>for</code> and <code>while</code> lines. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">i</span> = 0
<span style="color: #a020f0;">while</span> i &lt;= 10:
    <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"brittAnderson"</span>[i])
    <span style="color: #a0522d;">i</span> = i + 1
</pre>
</div>

<pre class="example" id="org7a1d64d">
b
r
i
t
t
A
n
d
e
r
s
</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgfbce17b" class="outline-4">
<h4 id="orgfbce17b"><span class="section-number-4">2.5.5.</span> Functions</h4>
<div class="outline-text-4" id="text-2-5-5">
<p>
We encountered an <a href="rstudio.html#orgc392190">example</a> of this earlier. Think
of a function as a machine that grinds meat. You pour in a cow.
You get out hamburger. Input -&gt; Output. Note that arguments are
"local". They are not referring to variables outside the function,
in the program globally, but only make sense locally in the
function. You drop values into those slots, and then you can use
those names in your function, because until you use it, your
function doesn't know what it will be getting.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">my_add</span>(x, y):
   <span style="color: #a020f0;">return</span>(x + y)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">my_add(2, 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3ba5f4" class="outline-4">
<h4 id="orgb3ba5f4"><span class="section-number-4">2.5.6.</span> Libraries</h4>
<div class="outline-text-4" id="text-2-5-6">
<p>
Lots of people use python. Python has been around a long time. Almost anything you might think to do at this point has been done by someone else. Look for a library and use someone else's code if you can. Use your time and effort to perfect your particular project, not to reinvent the wheel. An advantage of popular libraries is that they are likely to have withstood the tests of many users and will be more robust and correct than something you are likely to write as a first effort. 
</p>
</div>
<ol class="org-ol">
<li><a id="org24998dd"></a>What are some popular libraries?<br />
<div class="outline-text-5" id="text-2-5-6-1">
<p>
<a href="https://pythontips.com/2013/07/30/20-python-libraries-you-cant-live-without/">Here</a> are 20 recommended ones (and a more recent <a href="https://www.ubuntupit.com/best-python-libraries-and-packages-for-beginners/">list</a>).
</p>

<p>
Of particular note for us are:
</p>
<ol class="org-ol">
<li>Numpy</li>
<li>Scipy</li>
<li>Matplotlib</li>
<li>Pillow</li>
<li>Sympy</li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1926ff8" class="outline-4">
<h4 id="org1926ff8"><span class="section-number-4">2.5.7.</span> Programs</h4>
<div class="outline-text-4" id="text-2-5-7">
<p>
Programs are simply collections of all of the above. Complex programs may have smaller programs as components or span many files and subsidiary libraries.
</p>
</div>
</div>
<div id="outline-container-org399ca38" class="outline-4">
<h4 id="org399ca38"><span class="section-number-4">2.5.8.</span> Debugging and Basic Working Methods</h4>
<div class="outline-text-4" id="text-2-5-8">
<p>
Debugging refers to the general process of finding the mistakes in your code and fixing them. Bugs can be mistakes that keep your code from running or they can be mistakes in your logic. Then the code runs, but it doesn't do what you want. Those are the worst, and the hardest to fix. 
</p>

<p>
Many programming environments will provide sophisticated tools for debugging, but to get going a fairly simple technique is to embed many <code>print</code> statements into your code so that you can see what happening and whether your variables are actually changing like you think they should. When all is working well go back into your code and <span class="underline">comment out</span> or delete the print statements. 
</p>
</div>
</div>
<div id="outline-container-org9759feb" class="outline-4">
<h4 id="org9759feb"><span class="section-number-4">2.5.9.</span> IDEs</h4>
<div class="outline-text-4" id="text-2-5-9">
<p>
What does IDE stand for: Integrated development environment.
</p>

<p>
Two popular python IDEs are:
</p>
<ol class="org-ol">
<li>Spyder</li>
<li>pyCharm</li>
</ol>
</div>
<ol class="org-ol">
