chapters/beginning-python.org
**** [[https://realpython.com/emacs-the-best-python-editor/][Emacs as a python IDE]]
     *For this course I recommend using emacs.*[fn:1]
     A simple demonstration of vanilla emacs.
     1. Open up a blank file with a name that ends in .py
     2. Type in some lines (e.g. a = 2, b = 3, print(a+b))
     3. Type C-c C-c on the first line.
     4. Read the error message
     5. Fix it.
     6. Keep C-c C-c'ing on each line and look at what is happening in your console.
     7. When your cursor is on a python word, like ~print~, look in the mode line.
     8. Try ~M-x linum-mode~
     9. Looking for something more full featured? Try =elpy=. Instructions to install found [[file:emacsPythonIdeInstructions.org][here]]. 
** Pip to Install Libraries and Virtual Environments
   In general, try to use one packaging system for your installation. If you chose to get your packages via Ubuntu repositories (i.e. =apt=) then try to get as many from there as you can. 
   Otherwise the =pip= tool is convenient. 
*** Pip
    =pip= is the python install package program. There have been many ways to install python packages over the years and you will find a lot of tracks on the internet.  For now stick with pip (ubuntu also has many of these packages, but I find it better to try and not to mix package managers. Use your choice; mine is pip).
*** Virtual Environments
    When you install software to your system there is always a chance that you will install packages that conflict with each other. One way to reduce the risk of this problem is to install your programs and packages into small isolated sandboxes. The idea is that each sandbox exists independent of each of the others and only sees the packages that are installed locally to it. [[https://docs.python.org/3/tutorial/venv.html][Virtual environments]] are a way to achieve this sandboxing, and python has built in tools to support this idea. The use of =venv= and similar ideas is beyond the scope of what we have time for here, but it is not overly complicated to set up and use. You should read further on this topic if you plan to use python more extensively in the future. Another related approach is to use [[https://www.geeksforgeeks.org/set-up-virtual-environment-for-python-using-anaconda/][conda/anaconda]].
*** Beginning Python Assessment 2
    [[file:~/gitRepos/Intro2Computing4Psychology/assessments/hangmanPython.org][hangman and python assessment]]

   

* Assessments
I have found that these assignments are where many people feel like things start getting tough so I recorded a little video with some hints and encouragment.

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458286064?h=5a05c9cd0a" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458286064">Ge : Hints and Overview of the Two Beginning Python Assesments (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Beginning python assessments: hints and words of encouragement.</p>
#+end_export

** For Loop with Python

*** Task 
  Write a function that will print a list of characters unsorted, sorted, and combined. To complete this task you will need to be familiar with how to write a *for loop*, use python's *indexing*, and also how to use the [[https://realpython.com/python-formatted-output/][print format command]] [fn:3] 

*** What it should look like
  I run your function with "trib". It prints t, r, i, b, then prints b, i, r, t, and then prints something like "The first letter of list one is 't', but it is 'b' in the sorted list... and so on through all the letters.

*** Detailed Instructions
  1. Create a list of at least 8 individual characters.
  2. Make sure they are **not** in alphabetical order
  3. Print the letters one at a time.
  4. Print the letters sorted alphabetically one at a time, but /do not/ overwrite your original list.
  5. Print the letters from both lists with a format command that says which position the letter is in. 

*** Comments
**** Hints
   Remember not to re-invent the wheel. For example, does python have a function for sorting lists? Can you turn a "string" into a python list that would allow you to use indices? Lastly, note that a for loop can use more than one variable at a time. For my version I have a line that reads, 

   #+begin_src python :session *beginpython* :exports code :eval never
	 for i, l in enumerate(zip(my_list, sorted(my_list))):
   #+end_src

   #+RESULTS:
*** How I Will Grade
   I will run your program from the command line e.g. =python firstLast2LstsSorted.py=. It will either spit out the correct lists or it won't. If it does you get full credit, and if not I will give partial credit and you can try to fix it for more points. 

** Hangman in Python (starter kit)

*** Words of Encouragement
  This is the first non-trivial thing we will have done in the programming line. Do not get too frustrated if it takes you several submissions to get things right.

  Remember our goal is to learn some programming basics, not to write a production quality game of hangman. It is better to spend your time perfecting your ability to get the basic pieces

We all start as beginners. Be patient with yourself.

It is *fine* to collaborate, but don't just turn in a working piece of code you got from someone, because while that will give you points, it will not provide you an education. Make sure you can write it yourself from scratch even if that is only after you have worked on it together with someone.

How to work. I like the idea of having a console open on one side for testing and another editor window where I can write code. I write in one window. Test in the other, and go back and forth to get something I can use. Ask me to demo in class if you are not clear on what this is supposed to look like. 

