book/beginning-python.html
<li><a id="org3c4456f"></a><a href="https://realpython.com/emacs-the-best-python-editor/">Emacs as a python IDE</a><br />
<div class="outline-text-5" id="text-2-5-9-1">
<p>
<b>For this course I recommend using emacs.</b><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
A simple demonstration of vanilla emacs.
</p>
<ol class="org-ol">
<li>Open up a blank file with a name that ends in .py</li>
<li>Type in some lines (e.g. a = 2, b = 3, print(a+b))</li>
<li>Type C-c C-c on the first line.</li>
<li>Read the error message</li>
<li>Fix it.</li>
<li>Keep C-c C-c'ing on each line and look at what is happening in your console.</li>
<li>When your cursor is on a python word, like <code>print</code>, look in the mode line.</li>
<li>Try <code>M-x linum-mode</code></li>
<li>Looking for something more full featured? Try <code>elpy</code>. Instructions to install found <a href="emacsPythonIdeInstructions.html">here</a>.</li>
</ol>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orga9d081c" class="outline-3">
<h3 id="orga9d081c"><span class="section-number-3">2.6.</span> Pip to Install Libraries and Virtual Environments</h3>
<div class="outline-text-3" id="text-2-6">
<p>
In general, try to use one packaging system for your installation. If you chose to get your packages via Ubuntu repositories (i.e. <code>apt</code>) then try to get as many from there as you can. 
Otherwise the <code>pip</code> tool is convenient. 
</p>
</div>
<div id="outline-container-orgcad3d12" class="outline-4">
<h4 id="orgcad3d12"><span class="section-number-4">2.6.1.</span> Pip</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
<code>pip</code> is the python install package program. There have been many ways to install python packages over the years and you will find a lot of tracks on the internet.  For now stick with pip (ubuntu also has many of these packages, but I find it better to try and not to mix package managers. Use your choice; mine is pip).
</p>
</div>
</div>
<div id="outline-container-org1c6537e" class="outline-4">
<h4 id="org1c6537e"><span class="section-number-4">2.6.2.</span> Virtual Environments</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
When you install software to your system there is always a chance that you will install packages that conflict with each other. One way to reduce the risk of this problem is to install your programs and packages into small isolated sandboxes. The idea is that each sandbox exists independent of each of the others and only sees the packages that are installed locally to it. <a href="https://docs.python.org/3/tutorial/venv.html">Virtual environments</a> are a way to achieve this sandboxing, and python has built in tools to support this idea. The use of <code>venv</code> and similar ideas is beyond the scope of what we have time for here, but it is not overly complicated to set up and use. You should read further on this topic if you plan to use python more extensively in the future. Another related approach is to use <a href="https://www.geeksforgeeks.org/set-up-virtual-environment-for-python-using-anaconda/">conda/anaconda</a>.
</p>
</div>
</div>
<div id="outline-container-orgbb1d443" class="outline-4">
<h4 id="orgbb1d443"><span class="section-number-4">2.6.3.</span> Beginning Python Assessment 2</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
<a href="file:///home/britt/gitRepos/Intro2Computing4Psychology/assessments/hangmanPython.html">hangman and python assessment</a>
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-orgea17ae7" class="outline-2">
<h2 id="orgea17ae7"><span class="section-number-2">3.</span> Assessments</h2>
<div class="outline-text-2" id="text-3">
<p>
I have found that these assignments are where many people feel like things start getting tough so I recorded a little video with some hints and encouragment.
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/458286064?h=5a05c9cd0a" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/458286064">Ge : Hints and Overview of the Two Beginning Python Assesments (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Beginning python assessments: hints and words of encouragement.</p>
</div>

<div id="outline-container-org37ffc04" class="outline-3">
<h3 id="org37ffc04"><span class="section-number-3">3.1.</span> For Loop with Python</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orge0affa1" class="outline-4">
<h4 id="orge0affa1"><span class="section-number-4">3.1.1.</span> Task</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Write a function that will print a list of characters unsorted, sorted, and combined. To complete this task you will need to be familiar with how to write a <b>for loop</b>, use python's <b>indexing</b>, and also how to use the <a href="https://realpython.com/python-formatted-output/">print format command</a> <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup> 
</p>
</div>
</div>

<div id="outline-container-orgd3addd5" class="outline-4">
<h4 id="orgd3addd5"><span class="section-number-4">3.1.2.</span> What it should look like</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
I run your function with "trib". It prints t, r, i, b, then prints b, i, r, t, and then prints something like "The first letter of list one is 't', but it is 'b' in the sorted list&#x2026; and so on through all the letters.
</p>
</div>
</div>

<div id="outline-container-org3032d6a" class="outline-4">
<h4 id="org3032d6a"><span class="section-number-4">3.1.3.</span> Detailed Instructions</h4>
<div class="outline-text-4" id="text-3-1-3">
<ol class="org-ol">
<li>Create a list of at least 8 individual characters.</li>
<li>Make sure they are <b><b>not</b></b> in alphabetical order</li>
<li>Print the letters one at a time.</li>
<li>Print the letters sorted alphabetically one at a time, but <i>do not</i> overwrite your original list.</li>
<li>Print the letters from both lists with a format command that says which position the letter is in.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd717d0c" class="outline-4">
<h4 id="orgd717d0c"><span class="section-number-4">3.1.4.</span> Comments</h4>
<div class="outline-text-4" id="text-3-1-4">
</div>
<ol class="org-ol">
<li><a id="org0cdbe75"></a>Hints<br />
<div class="outline-text-5" id="text-3-1-4-1">
<p>
Remember not to re-invent the wheel. For example, does python have a function for sorting lists? Can you turn a "string" into a python list that would allow you to use indices? Lastly, note that a for loop can use more than one variable at a time. For my version I have a line that reads, 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">for</span> i, l <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(<span style="color: #483d8b;">zip</span>(my_list, <span style="color: #483d8b;">sorted</span>(my_list))):
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc4a6202" class="outline-4">
<h4 id="orgc4a6202"><span class="section-number-4">3.1.5.</span> How I Will Grade</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
I will run your program from the command line e.g. <code>python firstLast2LstsSorted.py</code>. It will either spit out the correct lists or it won't. If it does you get full credit, and if not I will give partial credit and you can try to fix it for more points. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgd97419d" class="outline-3">
<h3 id="orgd97419d"><span class="section-number-3">3.2.</span> Hangman in Python (starter kit)</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgf6c3db4" class="outline-4">
<h4 id="orgf6c3db4"><span class="section-number-4">3.2.1.</span> Words of Encouragement</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
This is the first non-trivial thing we will have done in the programming line. Do not get too frustrated if it takes you several submissions to get things right.
</p>

<p>
Remember our goal is to learn some programming basics, not to write a production quality game of hangman. It is better to spend your time perfecting your ability to get the basic pieces
</p>

<p>
We all start as beginners. Be patient with yourself.
</p>

<p>
It is <b>fine</b> to collaborate, but don't just turn in a working piece of code you got from someone, because while that will give you points, it will not provide you an education. Make sure you can write it yourself from scratch even if that is only after you have worked on it together with someone.
</p>

<p>
How to work. I like the idea of having a console open on one side for testing and another editor window where I can write code. I write in one window. Test in the other, and go back and forth to get something I can use. Ask me to demo in class if you are not clear on what this is supposed to look like. 
</p>
</div>
</div>
