book/beginning-python.html

<div id="outline-container-orgee39311" class="outline-4">
<h4 id="orgee39311"><span class="section-number-4">3.2.2.</span> Task</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
To write the beginning pieces of a hangman game in python. This version will <a href="https://en.wikipedia.org/wiki/Hard_coding">hard code</a> the word to be guessed. It will not produce any sort of graphic, You will ask the user for  letters and report if the player spells out the word or not. Depending on how fast you master that, I may suggest further improvements when you submit. 
</p>
</div>
</div>

<div id="outline-container-org9d7943f" class="outline-4">
<h4 id="org9d7943f"><span class="section-number-4">3.2.3.</span> Detail - tackle this in steps.</h4>
<div class="outline-text-4" id="text-3-2-3">
<ol class="org-ol">
<li>Look up how to get user input from python on the command line.
Write a script<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> that when run from the terminal (command line) asks for a word, and prints it out.</li>
<li>Write a <code>function</code> that takes as input a word. The function asks the user to guess a letter and returns <b>a list of</b> indices of the positions where the letter exists in the word. An empty list means the letter is not to be found in the word. Otherwise, the elements of this list are the indices where that letter is found. For example, if the word were "tree" and the letter "e" was guessed you would get back <code>[2,3]</code> from this function, but you would get back <code>[]</code> if the user supplied the letter were "s".<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup></li>
<li>Write a function that accepts as input a number, which we will interpret as the maximum number of guesses a player is allowed (call it <code>max_times</code>). This function will use a word that you have hard coded as a constant and will loop through the guessing function above for max<sub>times</sub> or until all the letter in the word have been guessed.</li>
<li>If the number of user guesses is greater than <code>max_times</code> your program should print "You lose." If the user guesses all the letters print "You win". And exit the program.</li>
</ol>
</div>
</div>

<div id="outline-container-orgacaf0b7" class="outline-4">
<h4 id="orgacaf0b7"><span class="section-number-4">3.2.4.</span> Comments</h4>
<div class="outline-text-4" id="text-3-2-4">
</div>
<ol class="org-ol">
<li><a id="org65e1e4b"></a>How I Will Grade<br />
<div class="outline-text-5" id="text-3-2-4-1">
<p>
I will run your program from the terminal, and it will work as above or it will not. If it does, I will give you full marks, if not, I will give partial credit and allow you to try and fix the mistakes. 
</p>
</div>
</li>
<li><a id="org614d404"></a>Hints<br />
<div class="outline-text-5" id="text-3-2-4-2">
<p>
You might find it useful to learn about python's <code>in</code> operator, and to think about how you might use the <code>enumerate</code> function we used in the <a href="forLoopPythonAssessment.html">for loop in python assessment</a>.
Remember to eliminate the letters from your word as they are guessed. For example if the word is tree, and I guess "e", your word should become "tr". That means you may find it easier to keep track of the indices that are <b>not</b> equal to the guessed letters.
If a brute force solution comes quickly think about re-writing your answer using a <a href="https://www.programiz.com/python-programming/list-comprehension">list comprehension</a>.
If you have more of a programming background try adding in some additional features of the game. Can you get a random word from the internet? Can you let the player give the word and the computer guess letters? Could you output where the guessed characters appear in the word before the player has to make their next guess. Could you generate some <a href="https://codegolf.stackexchange.com/questions/135936/ascii-hangman-in-progress">simple ascii art of the hangman character</a>?
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For this to work you will have to have R installed. If you have not done so already try <code>sudo apt install r-base</code> from a terminal, and then re-run the command.  
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Why use emacs as your python ide? There is a lot to learn in this course. If you choose a different tool for every job you will greatly increase your cognitive load. By using emacs for everything you can gradually learn to use one tool and focus your thinking on the stuff you are trying to learn and not the tool you need to master it. That said, you may later on choose to use something other than Emacs. Fine. But at least you will be familiar with the Swiss Army Knife of computing. It may not be the best tool for every job, but you can use it to get almost anything done, and that is a handy tool to have in your kit.  
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Not shown in lecture, but explained in many <a href="https://realpython.com/python-formatted-output/">places</a>. Look for the <code>string.format()</code> method.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Why is it 2,3 and not 3,4? 
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A script is a file that ends with .py and that I can call from the terminal. If your script is named hangman.py then things should work when I do <code>python hangman.py</code> in my terminal window.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-07 Tue 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-04-23 Sun 11:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>